Repository: carloscasanovad/everest_flutter_crypto_tests
Catalog: lib/l10n/app_*.arb
Languages: es, pt

source: Crypto
es: Cripto
pt: Cripto

# userBalance
source: Total balance:
es: Valor total de monedas:
pt: Valor total de moedas:

source: Details:
es: Detalles:
pt: Detalhes:

source: Convert crypto
es: Convertir cripto
pt: Converter cripto

source: Current price
es: Precio actual
pt: Preço actual

# priceVariation
source: Change %
es: Variación %
pt: Variação

# userCryptoQuantity
source: Balance
es: Cantidad
pt: Quantidade

# userCryptoValue
source: Value
es: Valor
pt: Valor

source: Exchange
es: Convertir
pt: Converter

source: Total:
es: Total estimado:
pt: Total estimado:

# exchangeTitle
source: How much would you like to convert?
es: Cuanto te gustaría convertir?
pt: Quanto você gostaria de converter?

source: Insufficient funds!
es: Saldo insuficiente!
pt: Saldo insuficiente!

source: Total balance:
es: Saldo disponible:
pt: Saldo disponivel:

# confirm
source: Confirm conversion
es: Confirmar conversión
pt: Confirmar conversão

# confirmTitle
source: Confirm your conversion
es: Revise los datos de su conversión
pt: Revise os dados da su conversão

source: Convert
es: Convertir para
pt: Converter

source: Pay with
es: Pagar con
pt: Converter

source: Receive
es: Recibir
pt: Receber

source: Exchange rate
es: Cambio
pt: Câmbio

source: Portfolio
es: Portafolio

source: Transactions
es: Movimentaciones
pt: Movimentações

# successTitle
source: Conversion completed
es: Conversión realizada
pt: Conversão efetuada

# successSubtitle
source: Your conversion was successfully completed!
es: Conversión de moneda realizada con éxito!
pt: Conversão de moeda efetuada com sucesso!

# transactionBillTitle
source: Bill of
es: Comprovante de
pt: Comprovante de

# transactionBillSubtitle
source: exchange
es: conversión
pt: conversão

source: Quantity converted
es: Cantidad convertida
pt: Quantidade convertida

source: Quantity receive
es: Cantidad recibida
pt: Quantidade recebida

# transactionsAppBar
source: Transactions
pt: Movimentacões
